Revit 2024 API
MathComparisonUtils.IsAlmostEqual Method
 Checks if two doubles are almost equal, using the internal tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static bool IsAlmostEqual(
	double value1,
	double value2
)
Visual Basic
Public Shared Function IsAlmostEqual ( _
	value1 As Double, _
	value2 As Double _
) As Boolean
Visual C++
public:
static bool IsAlmostEqual(
	double value1,
	double value2
)
Parameters
value1
Type: System.Double
 The first value.
value2
Type: System.Double
 The second value.
Return Value
 True if two doubles are almost equal, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for value1 is not finite -or- The given value for value2 is not finite
See Also
MathComparisonUtils Class
Autodesk.Revit.DB Namespace